# VoltageIsOutOfRange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..VoltageIsOutOfRange Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Ground Voltage for [Element] (The Line to Ground Voltage is specified in the assigned Distribution System)."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId VoltageIsOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VoltageIsOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ VoltageIsOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace